Repository: 11Jou/eho
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ar

source: QHSE
ar: الجودة والصحة والسلامة والبيئة

source: Home
ar: الرئيسية

source: Policy
ar: سياسة

source: Certificate
ar: شهادات

source: Videos
ar: فيديوهات

source: Photo Gallery
ar: معرض الصور

source: No Data Available
ar: لا تتوافر بيانات

source: About Us
ar: معلومات عنا

source: About El-Hamra Oil
ar: معلومات عن الحمرا اويل

source: According to the concession agreement issued on 8/8/2005 by Law No. 172 of 2005, El Hamra Oil Company was established, which is one of the companies in the joint petroleum sector between the Egyptian General Petroleum Corporation and the American company IPR, where the company carries out research, exploration, development, and production activities. in El Alamein field area. Western Sahara, Yidma. El Hamra Oil Company maintains its persistent efforts year after year, believing in the growing importance of energy and its impact on all economic, social, and political levels.
ar: وفقًا لاتفاقية الامتياز الصادرة في 8/8/2005 بموجب القانون رقم 172 لسنة 2005، تم تأسيس شركة الحمرا للنفط، وهي إحدى الشركات في القطاع البترولي المشترك بين الهيئة المصرية العامة للبترول والشركة الأمريكية IPR، حيث تقوم الشركة بأنشطة البحث، الاستكشاف، التطوير، والإنتاج في منطقة حقل العلمين، الصحراء الغربية، يدما. تحافظ شركة الحمرا للنفط على جهودها المستمرة عامًا بعد عام، إيمانًا منها بالأهمية المتزايدة للطاقة وتأثيرها على جميع المستويات الاقتصادية، الاجتماعية، والسياسية.

source: Stakeholders
ar: المساهمون

source: Is an economic State Corporation affiliated to the Ministry of Petroleum.
ar: هي شركة اقتصادية تابعة لوزارة النفط.

source: Energy Group is a group of international companies in the energy sector actively engaged in oil and gas exploration and production around the world; and providing engineering and oilfield services worldwide. We capitalize on our technical expertise and innovation to improve petroleum recovery, whether in our own E&P portfolio or through our global service offerings to the market.
ar: مجموعة الطاقة هي مجموعة من الشركات الدولية في قطاع الطاقة التي تنشط في استكشاف وإنتاج النفط والغاز حول العالم؛ وتقديم الخدمات الهندسية وخدمات الحقول النفطية على مستوى العالم. نحن نستفيد من خبراتنا الفنية وابتكاراتنا لتحسين استعادة النفط، سواء في محفظة الاستكشاف والإنتاج الخاصة بنا أو من خلال خدماتنا العالمية المقدمة للسوق.

source: Prespectives
ar: توقعات

source: Explore and develop oil and gas fields in the concession Agreement of Fayum to maximize value for Both sides and contribute to the growth of the country’s economy. We will accomplish this by:
ar: استكشاف وتطوير حقول النفط والغاز في اتفاقية امتياز الفيوم لتعظيم القيمة للطرفين والمساهمة في نمو اقتصاد البلاد. سنحقق ذلك من خلال:

source: Safely and economically optimizing production and maximizing reserves whilst protecting the environment
ar: تحسين الإنتاج وزيادة الاحتياطيات بأمان وبشكل اقتصادي مع حماية البيئة

source: Meeting oil and gas demand for an expanding local economy
ar: تلبية الطلب على النفط والغاز من أجل توسيع الاقتصاد المحلي

source: Prudently investing and stewarding this national resource
ar: استثمار هذا المورد الوطني وإدارته بحكمة

source: Providing employment and economic growth opportunities to the people of Egypt
ar: توفير فرص العمل والنمو الاقتصادي لشعب مصر

source: Values
ar: قيم

source: Our behavior is what defines us as a company, as employees, as people. Everything we do is anchored by our company values: excellence, safety, integrity, and accountability. By living our values, and prioritizing sound business practices, we consistently achieve high levels of performance and efficiency
ar: سلوكنا هو ما يحددنا كشركة، كموظفين، كأشخاص. كل ما نقوم به يتماشى مع قيمنا كشركة: التميز، السلامة، النزاهة، والمساءلة. من خلال العيش بقيمنا وإعطاء الأولوية لممارسات الأعمال السليمة، نحقق باستمرار مستويات عالية من الأداء والكفاءة

source: Our Website is Under reviewing and updating, You can visit us soon after reviewing the website data
ar: موقعنا تحت المراجعة والتحديث، يمكنك زيارتنا قريباً بعد مراجعة بيانات الموقع

source: OK
ar: حسنا

source: Address
ar: العنوان

source: 54 Mohamed Safwat, Alexandria, Egypt
ar: 54 ش محمد صفوت الاسكندرية , مصر

source: Main Links
ar: الروابط الرئيسية

source: Career
ar: الحياة المهنية

source: Contact Us
ar: تواصل معنا

source: Other Links
ar: روابط اخري

source: News
ar: الاخبار

source: Events
ar: الاحداث

source: El Hamra Oil
ar: الحمرا اويل

source: All Right Reserved
ar: جميع الحقوق محفوظة

source: Powered By
ar: مشغل بواسطة

source: About Company
ar: عن الشركة

source: CSR
ar: المسؤولية الاجتماعية للشركات

source: Management
ar: الإدارة

source: Operations & Services
ar: العمليات والخدمات

source: Exploration
ar: الاستكشافات

source: Operation
ar: التشغيل

source: ICT
ar: تكنولوجيا المعلومات

source: Media Center
ar: المركز الاعلامي

source: Job Application
ar: طلب وظيفي

source: Full Name
ar: الاسم الكامل

source: Email Address
ar: عنوان البريد الإلكتروني

source: Phone Number
ar: رقم التليفون

source: Submit
ar: ارسال

source: Contact
ar: تواصل معنا

source: Your Name
ar: اسمك

source: Message
ar: رسالتك

source: Send Message
ar: ارسال رسالة

source: Corporate social responsibility
ar: المسؤولية الاجتماعية للشركات

source: Drilling
ar: حفر

source: Drilling Activities
ar: أنشطة الحفر

source: Petroleum Engineering Activities
ar: أنشطة هندسة البترول

source: Last Events
ar: اخر الاحداث

source: El-Hamra Oil Events
ar: احداث الحمرا اويل

source: Explorations
ar: الاستكشافات

source: El Hamra Oil Company was established in August 2005 to be one of the main petroleum sector entities to run all exploratory and development activities over Alamein / Yidma oil fields , aiming to increase the production potentiality and finding new booked reserves.
ar: تم تأسيس شركة الحمرا اويل في أغسطس 2005 لتكون واحدة من الكيانات الرئيسية في قطاع البترول لتنفيذ جميع الأنشطة الاستكشافية والتطويرية في حقول نفط العلمين/يدما، بهدف زيادة القدرة الإنتاجية والعثور على احتياطيات جديدة محجوزة.

source: Read More
ar: اقرأ المزيد

source: Throughout the fiscal year 2022/2023, geological and geophysical activities in Yidma/Alamein concession were concerned about the exploration and development in the concession. These efforts had been resulted in finalizing the 3D seismic reprocessing project for the Yidma/ Alamein concession and prospects evaluation portfolio to prepare a new exploratory drilling campaign
ar: طوال السنة المالية 2022/2023، كانت الأنشطة الجيولوجية والجيوفيزيائية في امتياز يدما/العلمين تركز على الاستكشاف والتطوير في الامتياز. أسفرت هذه الجهود عن الانتهاء من مشروع إعادة معالجة البيانات الزلزالية ثلاثية الأبعاد لامتياز يدما/ العلمين ومحفظة تقييم الفرص للتحضير لحملة حفر استكشافية جديدة.

source: HSE, which stands for Health, Safety, and Environment, is a framework that helps organizations manage and improve their performance in these areas. It comprises a set of practices that help organizations manage and control the quality of their products, the health and safety of their employees, and the environmental impact of their operations.
ar: الصحة والسلامة والبيئة، هي إطار عمل يساعد المنظمات على إدارة وتحسين أدائها في هذه المجالات. يتضمن مجموعة من الممارسات التي تساعد المنظمات على إدارة والتحكم في جودة منتجاتها، صحة وسلامة موظفيها، والأثر البيئي لعملياتها.

source: El-Hamra Oil Chairmans
ar: رؤساء الحمرا اويل

source: Page Not Found
ar: الصفحة غير موجودة

source: We’re sorry, the page you have looked for does not exist in our website!
ar: عذرًا، الصفحة التي بحثت عنها غير موجودة في موقعنا!

source: Go Back To Home
ar: العودة الي الرئيسية

source: Success
ar: نجاح

source: Thank You
ar: شكرا لك

source: Your Response has been submitted successfully! You can go back to the home page or continue browsing our site.
ar: تم إرسال استجابتك بنجاح! يمكنك العودة إلى الصفحة الرئيسية أو مواصلة تصفح موقعنا.

source: Last News
ar: اخر الاخبار

source: El-Hamra Oil News
ar: اخبار الحمرا اويل

source: Petroleum Engineering
ar: هندسة البترول
